{
  "_name_or_path": "Evolett/rubert-tiny2-finetuned-ner",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "emb_size": 312,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "id2label": {
    "0": "O",
    "1": "B-notes",
    "2": "B-requirements",
    "3": "B-terms",
    "4": "I-notes",
    "5": "I-requirements",
    "6": "I-terms"
  },
  "initializer_range": 0.02,
  "intermediate_size": 600,
  "label2id": {
    "B-notes": 1,
    "B-requirements": 2,
    "B-terms": 3,
    "I-notes": 4,
    "I-requirements": 5,
    "I-terms": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 2048,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 3,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.30.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 83828
}
